/*
1: 1                                        // 1
2: 1+1, 2                                   // 2
3: 1+1+1, 1+2, 3                            // 3
4: 1+1+1+1, 1+1+2, 2+2, 1+3                 // 4
5: 1+1+1+1+1, 1+1+1+2, 1+2+2, 1+1+3, 2+3    // 5

오름차순으로만 만들어야 한다.
memo[i][x] = i를 만들건데 이번엔 x를 사용할 것임
x를 사용하려면 memo[i-x][x보다 작거나 같은 수]에서 사용해야 함
*/
#include <stdio.h>

int main() {
    int memo[10001][4] = {[1][1] = 1, [2][1] = 1, [2][2] = 1, [3][1] = 1, [3][2] = 1, [3][3] = 1};

    for (int i = 4; i <= 10000; i++) {
        memo[i][1] = memo[i-1][1];
        memo[i][2] = memo[i-2][1] + memo[i-2][2];
        memo[i][3] = memo[i-3][1] + memo[i-3][2] + memo[i-3][3];
    }

    int T, n;
    scanf("%d", &T);
    while (T--) {
        scanf("%d", &n);
        printf("%d\n", memo[n][1] + memo[n][2] + memo[n][3]);
    }

    return 0;
}